In [ ]:
# Lista : Serie de elementos de diferente tipos mutables.
# tupla: Serie de elementos de diferente tipo inmutable.
# Diccionari: Serie de elementos con dos componentes(clave + Valor)
# Array : Serie de elementos de un mismo unico tipo de dato.

In [ ]:
# series ( array ) vs Numpy
# Dataframes ( Filas y Columnas ) # Indices y Nombres ()
# Paneles ( + 2 Dimensiones )

In [2]:
import pandas as pd

import pandas

from pandas import (
    read_csv,
    read_xml,
    read_excel
)

In [3]:
# Generar un dataframe a partir de una lista
data = [['Juan', 25], ['Pedro', 34], ['Luis', 45]]

# Asignar nombres y crear el dataframe:
df = pd.DataFrame(data, columns=['Nombre' , 'Edad'])

In [4]:
df

  Nombre  Edad
0   Juan    25
1  Pedro    34
2   Luis    45

In [5]:
# Crear un datafarme desde un diccionario

data = {
    'Nombre' : ['Juan', 'Pedro', 'Luis'],
    'Edad' : [25, 26, 36]
}

# Generamos el datafram
df = pd.DataFrame(data)

df

  Nombre  Edad
0   Juan    25
1  Pedro    26
2   Luis    36

In [6]:
# Leer un archivo CSV local
df = pd.read_csv('./utils/data/data.csv')

df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [10]:
# Leemos otro archivo que no tiene cabecera

df = pd.read_csv('./utils/data/data_without_header',
                 header= None,
                 names = ['Nombre', 'Edad', 'Ciudad']
                 )

df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [ ]:
# leer un archivo sin extension, pero con un diferente separador
df = pd.read_csv('./utils/data/data',
                sep= '|'
                )

df

  nombre  edad     ciudad
0   Juan    33     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla